Tekla Open API Reference for Tekla Structures 2025
HierarchicObject.Father Property
 The father of the hierarchical object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public HierarchicObject Father { get; set; }
Public Property Father As HierarchicObject
	Get
	Set
Property Value
Type: HierarchicObject
See Also
Reference
HierarchicObject Class
Tekla.Structures.Model Namespace